{
  "vocab": {
    "<PAD>": 0,
    "<EOS>": 1,
    "<UNK>": 2,
    "<BOS>": 3,
    "<SEP>": 4,
    "<MASK>": 5,
    "<CLS>": 6,
    "a": 7,
    "b": 8,
    "c": 9,
    "d": 10,
    "e": 11,
    "f": 12,
    "g": 13,
    "h": 14,
    "i": 15,
    "j": 16,
    "k": 17,
    "l": 18,
    "m": 19,
    "n": 20,
    "o": 21,
    "p": 22,
    "q": 23,
    "r": 24,
    "s": 25,
    "t": 26,
    "u": 27,
    "v": 28,
    "w": 29,
    "x": 30,
    "y": 31,
    "z": 32,
    "A": 33,
    "B": 34,
    "C": 35,
    "D": 36,
    "E": 37,
    "F": 38,
    "G": 39,
    "H": 40,
    "I": 41,
    "J": 42,
    "K": 43,
    "L": 44,
    "M": 45,
    "N": 46,
    "O": 47,
    "P": 48,
    "Q": 49,
    "R": 50,
    "S": 51,
    "T": 52,
    "U": 53,
    "V": 54,
    "W": 55,
    "X": 56,
    "Y": 57,
    "Z": 58,
    "0": 59,
    "1": 60,
    "2": 61,
    "3": 62,
    "4": 63,
    "5": 64,
    "6": 65,
    "7": 66,
    "8": 67,
    "9": 68,
    ".": 69,
    ",": 70,
    "!": 71,
    "?": 72,
    ";": 73,
    ":": 74,
    "'": 75,
    "-": 76,
    "\"": 77,
    "(": 78,
    ")": 79,
    "[": 80,
    "]": 81,
    "{": 82,
    "}": 83,
    "@": 84,
    "#": 85,
    "$": 86,
    "%": 87,
    "^": 88,
    "&": 89,
    "*": 90,
    "+": 91,
    "=": 92,
    "<": 93,
    ">": 94,
    "/": 95,
    "\\": 96,
    "|": 97,
    "`": 98,
    "~": 99,
    "_": 100,
    " ": 101,
    "\n": 102,
    "\t": 103,
    "á": 104,
    "é": 105,
    "í": 106,
    "ó": 107,
    "ú": 108,
    "ñ": 109,
    "ü": 110,
    "Á": 111,
    "É": 112,
    "Í": 113,
    "Ó": 114,
    "Ú": 115,
    "Ñ": 116,
    "Ü": 117,
    "¿": 118,
    "¡": 119,
    "e</w>": 120,
    "s</w>": 121,
    "in": 122,
    "n</w>": 123,
    "or": 124,
    "an": 125,
    "g</w>": 126,
    "ro": 127,
    "a</w>": 128,
    "ing</w>": 129,
    "en": 130,
    "th": 131,
    "ar": 132,
    "ci": 133,
    "mp": 134,
    "ti": 135,
    "pro": 136,
    "al": 137,
    "d</w>": 138,
    "co": 139,
    "te": 140,
    "is": 141,
    "the</w>": 142,
    "at": 143,
    "ce": 144,
    "t</w>": 145,
    "on</w>": 146,
    "y</w>": 147,
    "is</w>": 148,
    "for": 149,
    "proce": 150,
    "proces": 151,
    "tr": 152,
    "process": 153,
    "processing</w>": 154,
    "dat": 155,
    "ut": 156,
    "and</w>": 157,
    "am": 158,
    "o</w>": 159,
    "er": 160,
    "al</w>": 161,
    "de</w>": 162,
    "le": 163,
    "lear": 164,
    "za": 165,
    "imp": 166,
    "impor": 167,
    "comp": 168,
    "ón</w>": 169,
    "import": 170,
    "importan": 171,
    "important</w>": 172,
    "ma": 173,
    "de": 174,
    "vis": 175,
    "re": 176,
    "tion</w>": 177,
    "iza": 178,
    "inte": 179,
    "intel": 180,
    "ig": 181,
    "igen": 182,
    "comput": 183,
    "data</w>": 184,
    "ción</w>": 185,
    "learn": 186,
    "learning</w>": 187,
    "tran": 188,
    "trans": 189,
    "transfor": 190,
    "transform": 191,
    "ge</w>": 192,
    "ne": 193,
    "en</w>": 194,
    "cia</w>": 195,
    "je</w>": 196,
    "ce</w>": 197,
    "ur": 198,
    "ural</w>": 199,
    "gr": 200,
    "for</w>": 201,
    "arti": 202,
    "artif": 203,
    "artifi": 204,
    "artifici": 205,
    "artificial</w>": 206,
    "gu": 207,
    "gua": 208,
    "py": 209,
    "pyth": 210,
    "python</w>": 211,
    "cien": 212,
    "tw": 213,
    "bi": 214,
    "inteligen": 215,
    "un": 216,
    "la</w>": 217,
    "dato": 218,
    "datos</w>": 219,
    "computa": 220,
    "ui": 221,
    "er</w>": 222,
    "la": 223,
    "progr": 224,
    "program": 225,
    "ute": 226,
    "visi": 227,
    "dis": 228,
    "distr": 229,
    "distri": 230,
    "distrib": 231,
    "aut": 232,
    "auto": 233,
    "ien": 234,
    "und": 235,
    "undo</w>": 236,
    "ck": 237,
    "fo": 238,
    "fox": 239,
    "fox</w>": 240,
    "ju": 241,
    "jump": 242,
    "jumps</w>": 243,
    "ov": 244,
    "over</w>": 245,
    "p</w>": 246,
    "nat": 247,
    "natural</w>": 248,
    "ith": 249,
    "transformer": 250,
    "transformers</w>": 251,
    "m</w>": 252,
    "reco": 253,
    "es</w>": 254,
    "visu": 255,
    "visual": 256,
    "visualiza": 257,
    "lo": 258,
    "l</w>": 259,
    "ap": 260,
    "apr": 261,
    "apren": 262,
    "aprend": 263,
    "aprendiza": 264,
    "aprendizaje</w>": 265,
    "ient": 266,
    "iento</w>": 267,
    "par": 268,
    "para</w>": 269,
    "por": 270,
    "mo": 271,
    "bro": 272,
    "brow": 273,
    "brown</w>": 274,
    "transforming</w>": 275,
    "cam": 276,
    "cambi": 277,
    "cambia</w>": 278,
    "ciencia</w>": 279,
    "learn</w>": 280,
    "anal": 281,
    "analy": 282,
    "analyti": 283,
    "analytic": 284,
    "analytics</w>": 285,
    "computad": 286,
    "computador": 287,
    "computadora</w>": 288,
    "qui": 289,
    "quick": 290,
    "quick</w>": 291,
    "laz": 292,
    "lazy</w>": 293,
    "intell": 294,
    "intelligen": 295,
    "intelligence</w>": 296,
    "dee": 297,
    "deep</w>": 298,
    "lan": 299,
    "langua": 300,
    "language</w>": 301,
    "with": 302,
    "with</w>": 303,
    "programm": 304,
    "programming</w>": 305,
    "netw": 306,
    "networ": 307,
    "network": 308,
    "networks</w>": 309,
    "fro": 310,
    "from</w>": 311,
    "vision</w>": 312,
    "ima": 313,
    "image</w>": 314,
    "ition</w>": 315,
    "computing</w>": 316,
    "distribute": 317,
    "distributed</w>": 318,
    "sy": 319,
    "inteligencia</w>": 320,
    "el</w>": 321,
    "autom": 322,
    "automá": 323,
    "automáti": 324,
    "automático": 325,
    "automático</w>": 326,
    "rede": 327,
    "redes</w>": 328,
    "por</w>": 329,
    "lis": 330,
    "nu": 331,
    "nub": 332,
    "nube</w>": 333,
    "mod": 334,
    "le</w>": 335,
    "len": 336,
    "lengua": 337,
    "lenguaje</w>": 338,
    "prof": 339,
    "profundo</w>": 340,
    "con</w>": 341,
    "inteligente": 342,
    "inteligentes</w>": 343,
    "so": 344,
    "sof": 345,
    "softw": 346,
    "softwar": 347,
    "software</w>": 348,
    "do": 349,
    "dog</w>": 350,
    "mac": 351,
    "mach": 352,
    "machin": 353,
    "machine</w>": 354,
    "wor": 355,
    "worl": 356,
    "world</w>": 357,
    "scien": 358,
    "science</w>": 359,
    "neural</w>": 360,
    "compute": 361,
    "computer": 362,
    "computer</w>": 363,
    "recog": 364,
    "recogn": 365,
    "recognition</w>": 366,
    "rein": 367,
    "reinfor": 368,
    "reinforce": 369,
    "reinforcem": 370,
    "reinforcemen": 371,
    "reinforcement</w>": 372,
    "gam": 373,
    "games</w>": 374,
    "big</w>": 375,
    "visualization</w>": 376,
    "clo": 377,
    "clou": 378,
    "cloud</w>": 379,
    "sys": 380,
    "syste": 381,
    "system": 382,
    "systems</w>": 383,
    "mundo</w>": 384,
    "neu": 385,
    "neuro": 386,
    "neuron": 387,
    "neuronal": 388,
    "neuronales</w>": 389,
    "procesam": 390,
    "procesamiento</w>": 391,
    "programa": 392,
    "programación</w>": 393,
    "visión</w>": 394,
    "recon": 395,
    "recono": 396,
    "reconoci": 397,
    "reconocim": 398,
    "reconocimiento</w>": 399,
    "aná": 400,
    "anális": 401,
    "análisis</w>": 402,
    "visualización</w>": 403,
    "computación</w>": 404,
    "distribui": 405,
    "distribuid": 406,
    "distribuida</w>": 407,
    "sis": 408,
    "siste": 409,
    "sistema": 410,
    "sistemas</w>": 411,
    "automa": 412,
    "automati": 413,
    "automatiza": 414,
    "automatización</w>": 415,
    "des": 416,
    "desar": 417,
    "desarro": 418,
    "desarrol": 419,
    "desarroll": 420,
    "desarrollo</w>": 421,
    "moder": 422,
    "modern": 423,
    "moderno</w>": 424,
    "ss</w>": 425,
    "ex": 426,
    "alg": 427,
    "algor": 428,
    "algorith": 429,
    "algorithm</w>": 430,
    "fun": 431,
    "func": 432,
    "function</w>": 433,
    "var": 434,
    "vari": 435,
    "varia": 436,
    "variab": 437,
    "variable</w>": 438,
    "cla": 439,
    "class</w>": 440,
    "me": 441,
    "meth": 442,
    "metho": 443,
    "method</w>": 444,
    "arr": 445,
    "arra": 446,
    "array</w>": 447,
    "list</w>": 448,
    "di": 449,
    "dic": 450,
    "dicti": 451,
    "dictio": 452,
    "diction": 453,
    "dictionar": 454,
    "dictionary</w>": 455,
    "tu": 456,
    "tup": 457,
    "tuple</w>": 458,
    "se": 459,
    "set</w>": 460,
    "loo": 461,
    "loop</w>": 462,
    "con": 463,
    "cond": 464,
    "condition</w>": 465,
    "exce": 466,
    "excep": 467,
    "exception</w>": 468,
    "modu": 469,
    "module</w>": 470,
    "pa": 471,
    "pack": 472,
    "packa": 473,
    "package</w>": 474,
    "import</w>": 475,
    "expor": 476,
    "export</w>": 477,
    "asy": 478,
    "asyn": 479,
    "async": 480,
    "async</w>": 481,
    "aw": 482,
    "awa": 483,
    "awai": 484,
    "await</w>": 485,
    "prom": 486,
    "promis": 487,
    "promise</w>": 488,
    "to": 489,
    "tok": 490,
    "token</w>": 491,
    "em": 492,
    "emb": 493,
    "embe": 494,
    "embed": 495,
    "embedd": 496,
    "embedding</w>": 497,
    "att": 498,
    "atten": 499,
    "attention</w>": 500,
    "lay": 501,
    "layer</w>": 502,
    "mode": 503,
    "model</w>": 504,
    "tra": 505,
    "train": 506,
    "training</w>": 507,
    "inf": 508,
    "infer": 509,
    "inferen": 510,
    "inference</w>": 511,
    "op": 512,
    "opti": 513,
    "optim": 514,
    "optimiza": 515,
    "optimization</w>": 516,
    "gra": 517,
    "grad": 518,
    "gradien": 519,
    "gradient</w>": 520,
    "loss</w>": 521
  },
  "merges": [
    "e|</w>",
    "s|</w>",
    "i|n",
    "n|</w>",
    "o|r",
    "a|n",
    "g|</w>",
    "r|o",
    "a|</w>",
    "in|g</w>",
    "e|n",
    "t|h",
    "a|r",
    "c|i",
    "m|p",
    "t|i",
    "p|ro",
    "a|l",
    "d|</w>",
    "c|o",
    "t|e",
    "i|s",
    "th|e</w>",
    "a|t",
    "c|e",
    "t|</w>",
    "o|n</w>",
    "y|</w>",
    "i|s</w>",
    "f|or",
    "pro|ce",
    "proce|s",
    "t|r",
    "proces|s",
    "process|ing</w>",
    "d|at",
    "u|t",
    "an|d</w>",
    "a|m",
    "o|</w>",
    "e|r",
    "al|</w>",
    "d|e</w>",
    "l|e",
    "le|ar",
    "z|a",
    "i|mp",
    "imp|or",
    "co|mp",
    "ó|n</w>",
    "impor|t",
    "import|an",
    "importan|t</w>",
    "m|a",
    "d|e",
    "v|is",
    "r|e",
    "ti|on</w>",
    "i|za",
    "in|te",
    "inte|l",
    "i|g",
    "ig|en",
    "comp|ut",
    "dat|a</w>",
    "ci|ón</w>",
    "lear|n",
    "learn|ing</w>",
    "tr|an",
    "tran|s",
    "trans|for",
    "transfor|m",
    "g|e</w>",
    "n|e",
    "e|n</w>",
    "ci|a</w>",
    "j|e</w>",
    "c|e</w>",
    "u|r",
    "ur|al</w>",
    "g|r",
    "for|</w>",
    "ar|ti",
    "arti|f",
    "artif|i",
    "artifi|ci",
    "artifici|al</w>",
    "g|u",
    "gu|a",
    "p|y",
    "py|th",
    "pyth|on</w>",
    "ci|en",
    "t|w",
    "b|i",
    "intel|igen",
    "u|n",
    "l|a</w>",
    "dat|o",
    "dato|s</w>",
    "comput|a",
    "u|i",
    "er|</w>",
    "l|a",
    "pro|gr",
    "progr|am",
    "u|te",
    "vis|i",
    "d|is",
    "dis|tr",
    "distr|i",
    "distri|b",
    "a|ut",
    "aut|o",
    "i|en",
    "un|d",
    "und|o</w>",
    "c|k",
    "f|o",
    "fo|x",
    "fox|</w>",
    "j|u",
    "ju|mp",
    "jump|s</w>",
    "o|v",
    "ov|er</w>",
    "p|</w>",
    "n|at",
    "nat|ural</w>",
    "i|th",
    "transform|er",
    "transformer|s</w>",
    "m|</w>",
    "re|co",
    "e|s</w>",
    "vis|u",
    "visu|al",
    "visual|iza",
    "l|o",
    "l|</w>",
    "a|p",
    "ap|r",
    "apr|en",
    "apren|d",
    "aprend|iza",
    "aprendiza|je</w>",
    "ien|t",
    "ient|o</w>",
    "p|ar",
    "par|a</w>",
    "p|or",
    "m|o",
    "b|ro",
    "bro|w",
    "brow|n</w>",
    "transform|ing</w>",
    "c|am",
    "cam|bi",
    "cambi|a</w>",
    "cien|cia</w>",
    "lear|n</w>",
    "an|al",
    "anal|y",
    "analy|ti",
    "analyti|c",
    "analytic|s</w>",
    "computa|d",
    "computad|or",
    "computador|a</w>",
    "q|ui",
    "qui|ck",
    "quick|</w>",
    "la|z",
    "laz|y</w>",
    "intel|l",
    "intell|igen",
    "intelligen|ce</w>",
    "de|e",
    "dee|p</w>",
    "l|an",
    "lan|gua",
    "langua|ge</w>",
    "w|ith",
    "with|</w>",
    "program|m",
    "programm|ing</w>",
    "ne|tw",
    "netw|or",
    "networ|k",
    "network|s</w>",
    "f|ro",
    "fro|m</w>",
    "visi|on</w>",
    "i|ma",
    "ima|ge</w>",
    "i|tion</w>",
    "comput|ing</w>",
    "distrib|ute",
    "distribute|d</w>",
    "s|y",
    "inteligen|cia</w>",
    "e|l</w>",
    "auto|m",
    "autom|á",
    "automá|ti",
    "automáti|co",
    "automático|</w>",
    "re|de",
    "rede|s</w>",
    "por|</w>",
    "l|is",
    "n|u",
    "nu|b",
    "nub|e</w>",
    "mo|d",
    "l|e</w>",
    "l|en",
    "len|gua",
    "lengua|je</w>",
    "pro|f",
    "prof|undo</w>",
    "co|n</w>",
    "inteligen|te",
    "inteligente|s</w>",
    "s|o",
    "so|f",
    "sof|tw",
    "softw|ar",
    "softwar|e</w>",
    "d|o",
    "do|g</w>",
    "ma|c",
    "mac|h",
    "mach|in",
    "machin|e</w>",
    "w|or",
    "wor|l",
    "worl|d</w>",
    "s|cien",
    "scien|ce</w>",
    "ne|ural</w>",
    "comp|ute",
    "compute|r",
    "computer|</w>",
    "reco|g",
    "recog|n",
    "recogn|ition</w>",
    "re|in",
    "rein|for",
    "reinfor|ce",
    "reinforce|m",
    "reinforcem|en",
    "reinforcemen|t</w>",
    "g|am",
    "gam|es</w>",
    "bi|g</w>",
    "visualiza|tion</w>",
    "c|lo",
    "clo|u",
    "clou|d</w>",
    "sy|s",
    "sys|te",
    "syste|m",
    "system|s</w>",
    "m|undo</w>",
    "ne|u",
    "neu|ro",
    "neuro|n",
    "neuron|al",
    "neuronal|es</w>",
    "proces|am",
    "procesam|iento</w>",
    "program|a",
    "programa|ción</w>",
    "visi|ón</w>",
    "reco|n",
    "recon|o",
    "recono|ci",
    "reconoci|m",
    "reconocim|iento</w>",
    "an|á",
    "aná|lis",
    "anális|is</w>",
    "visualiza|ción</w>",
    "computa|ción</w>",
    "distrib|ui",
    "distribui|d",
    "distribuid|a</w>",
    "s|is",
    "sis|te",
    "siste|ma",
    "sistema|s</w>",
    "auto|ma",
    "automa|ti",
    "automati|za",
    "automatiza|ción</w>",
    "de|s",
    "des|ar",
    "desar|ro",
    "desarro|l",
    "desarrol|l",
    "desarroll|o</w>",
    "mod|er",
    "moder|n",
    "modern|o</w>",
    "s|s</w>",
    "e|x",
    "al|g",
    "alg|or",
    "algor|ith",
    "algorith|m</w>",
    "f|un",
    "fun|c",
    "func|tion</w>",
    "v|ar",
    "var|i",
    "vari|a",
    "varia|b",
    "variab|le</w>",
    "c|la",
    "cla|ss</w>",
    "m|e",
    "me|th",
    "meth|o",
    "metho|d</w>",
    "ar|r",
    "arr|a",
    "arra|y</w>",
    "lis|t</w>",
    "d|i",
    "di|c",
    "dic|ti",
    "dicti|o",
    "dictio|n",
    "diction|ar",
    "dictionar|y</w>",
    "t|u",
    "tu|p",
    "tup|le</w>",
    "s|e",
    "se|t</w>",
    "lo|o",
    "loo|p</w>",
    "co|n",
    "con|d",
    "cond|ition</w>",
    "ex|ce",
    "exce|p",
    "excep|tion</w>",
    "mod|u",
    "modu|le</w>",
    "p|a",
    "pa|ck",
    "pack|a",
    "packa|ge</w>",
    "impor|t</w>",
    "ex|por",
    "expor|t</w>",
    "a|sy",
    "asy|n",
    "asyn|c",
    "async|</w>",
    "a|w",
    "aw|a",
    "awa|i",
    "awai|t</w>",
    "pro|m",
    "prom|is",
    "promis|e</w>",
    "t|o",
    "to|k",
    "tok|en</w>",
    "e|m",
    "em|b",
    "emb|e",
    "embe|d",
    "embed|d",
    "embedd|ing</w>",
    "at|t",
    "att|en",
    "atten|tion</w>",
    "la|y",
    "lay|er</w>",
    "mo|de",
    "mode|l</w>",
    "tr|a",
    "tra|in",
    "train|ing</w>",
    "in|f",
    "inf|er",
    "infer|en",
    "inferen|ce</w>",
    "o|p",
    "op|ti",
    "opti|m",
    "optim|iza",
    "optimiza|tion</w>",
    "gr|a",
    "gra|d",
    "grad|ien",
    "gradien|t</w>",
    "lo|ss</w>"
  ],
  "config": {
    "vocab_size": 10000,
    "num_merges": 5000
  }
}